### Import Dependencies

In [16]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import db_user, db_password

### Extract CSVs into DataFrames

In [17]:
athletes_file = "Resources/athlete_events.csv"
athletes_df = pd.read_csv(athletes_file)
athletes_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [18]:
cost_per_file = "Resources/Cost_per_ event_and_cost_ per_athlete_in_the_Olympics.csv"
cost_per_df = pd.read_csv(cost_per_file)
cost_per_df.head()

,Games,Year,Country,Type,"Cost per event, mio. USD","Cost per athlete, mio. USD","event,"
0,Tokyo,1964,Japan,Summer,1.7,0.1,NaN
1,Munich,1972,Germany,Summer,5.2,0.1,NaN
2,Montreal,1976,Canada,Summer,30.8,1.0,NaN
3,Moscow,1980,Soviet Union,Summer,31.2,1.2,NaN
4,Los Angeles,1984,United States,Summer,3.3,0.1,NaN

In [19]:
total_cost_file = "Resources/Costs_ of_ the_ Olympic_ Games.csv"
total_cost_df = pd.read_csv(total_cost_file)
total_cost_df.head()

         Games  Year  Country    Type  Events  Athletes Cost, Billion USD
0         Rome  1960    Italy  Summer     150      5338               NaN
1        Tokyo  1964    Japan  Summer     163      5152             0.282
2  Mexico City  1968   Mexico  Summer     172      5516             n/a**
3       Munich  1972  Germany  Summer     195      7234             1.009
4     Montreal  1976   Canada  Summer     198      6048             6.093

### Transform athletes DataFrames

In [20]:
# Arrange Medals by Categories
#create a dataFrame for medals
df = athletes_df[["Medal"]]

#Create DataFrame for Gold
df1=df[df['Medal']=='Gold']
df1 = df1.rename(columns={"Medal": "Gold"})

#Create DataFrame for Silver
df2=df[df['Medal']=='Silver']
df2 = df2.rename(columns={"Medal": "Silver"})

#Create DataFrame for Silver
df3=df[df['Medal']=='Bronze']
df3 = df3.rename(columns={"Medal": "Bronze"})

# Concat DataFrames
df4 = pd.concat([df1, df2, df3], axis = 1)

# Rename the column headers
medal_df = df4.rename(columns={"Medal": "Gold", "Medal": "Silver", "Medal": "Bronze"})

#Update athletes_df with medal_df
ext_athletes_df = pd.concat([athletes_df, medal_df], axis = 1)

extract and transform medal dataframes to include a medal count¶

In [25]:
gold_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Gold"]]
# add an empty column
gold_df.insert(2,'tot_gold','')
gold_df = gold_df.groupby(["City", "Year", "Season",'NOC','Gold'], as_index=False)['tot_gold'].count()

In [26]:
silver_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Silver"]]
# add an empty column
silver_df.insert(2,'tot_silver','')
silver_df = silver_df.groupby(["City", "Year", "Season",'NOC','Silver'], as_index=False)['tot_silver'].count()

In [27]:
bronze_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Bronze"]]
# add an empty column
bronze_df.insert(2,'tot_bronze','')
bronze_df = bronze_df.groupby(["City", "Year", "Season",'NOC','Bronze'], as_index=False)['tot_bronze'].count()

In [28]:
medals_df = pd.merge(gold_df, silver_df, how='left', on=["City", "Year", "Season", "NOC"])
medals_tot = pd.merge(medals_df, bronze_df, how='left', on=["City", "Year", "Season", "NOC"])

#convert columns to integer type
#new_athlete_df.Tot_Gold = new_athlete_df.Tot_Gold.apply(int)
#new_athlete_df.Tot_Bronze = new_athlete_df.Tot_Bronze.apply(in
medals_tot = medals_tot.fillna(0)

#format columns

#medals_tot = medals_tot["Tot_Silver"].astype("int")
#medals_tot = medals_tot["Tot_Bronze"].astype("int")

medals_tot['tot_gold'] = medals_tot['tot_gold'].astype("int")
medals_tot['tot_silver'] = medals_tot['tot_silver'].astype("int")
medals_tot['tot_bronze'] = medals_tot['tot_bronze'].astype("int")
#.map("{: .0f}".format)

In [29]:
# Rename DataFrame
new_athletes_df = medals_tot[["City", "Year", "NOC", "tot_gold", "tot_silver", "tot_bronze"]]
new_athlete_df = new_athletes_df.dropna(subset=["tot_gold", "tot_silver", "tot_bronze"], how='all')

#Rename the column headers
new_athletes_df = new_athletes_df.rename(columns={"City": "city_olympics", "Year": "year_olympics",  "NOC": "country_team"})

new_athletes_df.head()

  city_olympics  year_olympics country_team  tot_gold  tot_silver  tot_bronze
0   Albertville           1992          AUT         9          10          10
1   Albertville           1992          CAN         5          28           3
2   Albertville           1992          EUN        35          10          14
3   Albertville           1992          FIN         6           1           6
4   Albertville           1992          FRA         5           6           1

In [30]:
#Correcting the names of cities to be the same in two df
new_athletes_df["city_olympics"].replace({'Moskva': 'Moscow', "Rio de Janeiro": "Rio", "Roma": "Rome", "Athina": "Athens" }, inplace=True)

### Transform cost_per DataFrames

In [31]:
# Create a filtered dataframe from specific columns
cost_per_cols = ["Games", "Country", "Year", "Type", "Cost per event, mio. USD", "Cost per athlete, mio. USD"]
new_cost_per_df= cost_per_df[cost_per_cols].copy()

# Rename the column headers
new_cost_per_df = new_cost_per_df.rename(columns={"Type": "season", "Games": "city_olympics", "Year": "year_olympics", 
                                                  "Country" : "country", 
                                                  "Cost per event, mio. USD": "cost_event_m", 
                                                  "Cost per athlete, mio. USD": "cost_athlete_m"})

new_cost_per_df.head()

,city_olympics,country,year_olympics,season,cost_event_m,cost_athlete_m
0,Tokyo,Japan,1964,Summer,1.7,0.1
1,Munich,Germany,1972,Summer,5.2,0.1
2,Montreal,Canada,1976,Summer,30.8,1.0
3,Moscow,Soviet Union,1980,Summer,31.2,1.2
4,Los Angeles,United States,1984,Summer,3.3,0.1

### Transform total_cost DataFrames

In [32]:
# Create a filtered dataframe from specific columns
total_cost_cols = ["Games", "Country", "Year", "Type", "Events", "Athletes", "Cost, Billion USD"]
new_total_cost_df= total_cost_df[total_cost_cols].copy()

#Replacing n/a values to NaN 
new_total_cost_df["Cost, Billion USD"].replace({"n/a**": "NaN"}, inplace=True)

# Rename the column headers
new_total_cost_df = new_total_cost_df.rename(columns={"Games": "city_olympics",  
                                                      "Type": "season", "city": "city_olympics", "Year": "year_olympics", 
                                                      "Country" : "country", "Events": "event", "Athletes" : "athletes",
                                                      "Cost, Billion USD" : "event_cost_b_usd"})

new_total_cost_df.head()

,city_olympics,country,year_olympics,season,event,athletes,event_cost_b_usd
0,Rome,Italy,1960,Summer,150,5338,NaN
1,Tokyo,Japan,1964,Summer,163,5152,0.282
2,Mexico City,Mexico,1968,Summer,172,5516,NaN
3,Munich,Germany,1972,Summer,195,7234,1.009
4,Montreal,Canada,1976,Summer,198,6048,6.093

In [34]:
#Merge two df : cost per and total cost
two_df = pd.merge( left =new_total_cost_df, right =new_cost_per_df, how='left', left_on = ('year_olympics', 'city_olympics'), 
                                                                             right_on  = ('year_olympics', 'city_olympics'))
#two_combined_df.sort_values(["city_olympics"])

two_combined_df = two_df[["city_olympics", "country_x", "year_olympics", "season_x", "event", 
                          "athletes", "event_cost_b_usd", "cost_event_m", "cost_athlete_m"]]

# Rename the column headers
two_combined_df = two_combined_df.rename(columns={"country_x": "country", "season_x": "season",
                                                 "cost_event_m": "cost_event_m_usd", "cost_athlete_m": "cost_athlete_m_usd"})
                                           
two_combined_df.copy()

,city_olympics,country,year_olympics,season,event,athletes,event_cost_b_usd,cost_event_m_usd,cost_athlete_m_usd
0,Rome,Italy,1960,Summer,150,5338,NaN,NaN,NaN
1,Tokyo,Japan,1964,Summer,163,5152,0.282,1.7,0.10
2,Mexico City,Mexico,1968,Summer,172,5516,NaN,NaN,NaN
3,Munich,Germany,1972,Summer,195,7234,1.009,5.2,0.10
4,Montreal,Canada,1976,Summer,198,6048,6.093,30.8,1.00
5,Moscow,Soviet Union,1980,Summer,203,5179,6.331,31.2,1.20
6,Los Angeles,United States,1984,Summer,221,6829,0.719,3.3,0.10
7,Seoul,South Korea,1988,Summer,237,8397,NaN,NaN,NaN
8,Barcelona,Spain,1992,Summer,257,9356,9.687,37.7,1.00
9,Atlanta,United States,1996,Summer,271,10318,4.143,15.3,0.40
10,Sydney,Australia,2000,Summer,300,10651,5.026,16.8,0.50
11,Athens,Greece,2004,Summer,301,10625,2.942,9.8,0.30
12,Beijing,China,2008,Summer,302,10942,6.81,22.5,0.60
13,London,United Kingdom,2012,Summer,302,10568,14.957,49.5,1.40
14,Rio,Brazil,2016,Summer,306,10500,4.557,14.9,0.40
15,Squaw Valley,United States,1960,Winter,27,665,NaN,NaN,NaN
16,Innsbruck,Austria,1964,Winter,34,1091,0.022,0.6,0.02
17,Grenoble,France,1968,Winter,35,1158,0.888,25.4,0.80
18,Sapporo,Japan,1972,Winter,35,1006,0.117,3.4,0.10
19,Innsbruck,Austria,1976,Winter,37,1123,0.118,3.2,0.10
20,Lake Placid,United States,1980,Winter,38,1072,0.435,11.5,0.40
21,Sarajevo,Yugoslavia,1984,Winter,39,1272,NaN,NaN,NaN
22,Calgary,Canada,1988,Winter,46,1432,1.109,24.1,0.80
23,Albertville,France,1992,Winter,57,1801,1.997,35.0,1.10
24,Lillehammer,Norway,1994,Winter,61,1737,2.228,36.5,1.30
25,Nagano,Japan,1998,Winter,68,2176,2.227,32.7,1.00
26,Salt Lake City,United States,2002,Winter,78,2399,2.52,32.3,1.10
27,Torino,Italy,2006,Winter,84,2508,4.366,52.0,1.70
28,Vancouver,Canada,2010,Winter,86,2566,2.54,29.5,1.00
29,Sochi,Russia,2014,Winter,98,2780,21.89,223.4,7.90

Create a list of unique cities in order to transfer to DB

In [36]:
# Connect to local

rds_connection_string = f'{db_user}:{db_password}@localhost:5432/Olympics'
engine = create_engine(f'postgresql://{rds_connection_string}')
engine

Engine(postgresql://postgres:***@localhost:5432/Olympics)

In [38]:
#Check for table
engine.table_names()

<ipython-input-38-61e16a250986>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['new_athletes', 'olympic_games']

In [260]:
print(city_olympics_df['city_olympics'].dtypes)
#df['DataFrame Column'].dtypes

object

In [39]:
new_athletes_df.to_sql(name='new_athletes', con=engine, if_exists='append', index=False)

In [40]:
two_combined_df.to_sql(name='olympic_games', con=engine, if_exists='append', index=False)

In [41]:
#Checking if the df is in postgres
pd.read_sql_query('select * from olympic_games', con=engine).head()

,city_olympics,country,year_olympics,season,event,athletes,event_cost_b_usd,cost_event_m_usd,cost_athlete_m_usd
0,Rome,Italy,1960,Summer,150,5338,NaN,NaN,NaN
1,Tokyo,Japan,1964,Summer,163,5152,0.282,1.7,0.1
2,Mexico City,Mexico,1968,Summer,172,5516,NaN,NaN,NaN
3,Munich,Germany,1972,Summer,195,7234,1.009,5.2,0.1
4,Montreal,Canada,1976,Summer,198,6048,6.093,30.8,1.0